[
  {
    "title": "The Death of a Spreadsheet",
    "content": "<!-- wp:paragraph -->\n<p>As every good tradesman will tell you, there’s a tool for\nevery job. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>You wouldn’t use a calculator to do a job for a spreadsheet\n(or vice versa, assuming you have a calculator to hand). By extension, with the\nwealth of technology solutions available to business today, why do we continue\nto rely so heavily on spreadsheets? </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Up and down the country, office workers are busily tapping\ndata into and tracking data in spreadsheets; colour-coding cells and building\ntheir own system in Excel. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Data likes to be free</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Some users will actively shun software systems in favour of\ntheir spreadsheet; perhaps manually updating systems periodically. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In our experience, this happens for one or more of the\nfollowing reasons:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li>The system provided is fundamentally unsuitable\nfor the task; </li><li>The system is too slow or overloads with\ninformation that the user doesn’t need;</li><li>The system doesn’t have fields necessary to\ntrack vital information; </li><li>The user finds the system too difficult to\nnavigate or work with;</li><li>The reporting from the system isn’t sufficient </li></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>These reasons can be distilled down to two main themes;\neither the system isn’t good enough or the user experience hinders users and\nslows them down. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Users like to manipulate data in their own way. Systems that\nrestrict the export of data or the number of reports that can be produced are\nbound to spawn uncontrolled ‘workarounds’. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>The risks of going rogue with spreadsheets</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Despite being the most widely-used business tool for\ndecades, spreadsheets can pose very real risk. Working with data in\nunstructured systems means that users can delete or overwrite data by mistake\nvery easily. When the data is financial, the risk can be ‘lost’ or misstated\nrevenue, profit or assets. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Untested formulas or models can lead to errors being\naccepted as reliable reports, upon which businesses can make critical\nassumptions and decisions. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Spreadsheets are also regularly ‘socialised’ between\ncolleagues by email and, although most organisations encrypt communications and\ncontrol devices, the ability to transfer data in spreadsheet format (i.e.\noutside of a system) can pose a serious information security risk. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Spreadsheets also open up the opportunity for deliberate\nfraud. When field history isn’t tracked, it’s easier to hide fraudulent\nbehaviour than it is in an auditable system. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>There is even a European organisation that highlights the risks\nassociated with spreadsheets, with some eye-watering examples of spreadsheet\nerrors that have cost billions of dollars and irreparable reputational damage (<a href=\"http://www.eusprig.org/horror-stories.htm\">http://www.eusprig.org/horror-stories.htm</a>)</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Using the right tool</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>With ‘low code’ development platforms like Salesforce, it\ncan take just days to produce basic applications to track records and produce\nreports that are customised to user needs. With such short development\ntimeframes, it’s possible to meet specific needs for even the smallest teams or\nfunctions within your organisation.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce applications can integrate with existing systems\nof record and can push data back into those systems either on a scheduled\ntransfer or via Application Programming Interfaces (APIs). </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Where teams are relying on spreadsheets, it’s generally\nbecause they have either been overlooked (or perhaps not anticipated) when an\norganisation designed its systems or it was too difficult or costly to meet\ntheir needs in development. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With ‘lode code’ development, applications can be developed\nup to 20 times faster than hard-coded systems; making it cost effective for\norganisations adopting the Salesforce platform to deliver custom-designed\nsystems to meet all the user requirements in their organisation. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For more information on using Salesforce to deliver useful\napplications built specifically for your team, contact us using the form below.\n</p>\n<!-- /wp:paragraph -->",
    "excerpt": "You wouldn’t use a calculator to do a job for a spreadsheet (or vice versa, assuming you have a calculator to hand). By extension, with the wealth of technology solutions available to business today, why do we continue to rely so heavily on spreadsheets? ",
    "link": "https://appdraft.com/2019/01/11/death-of-a-spreadsheet/",
    "type": "post",
    "slug": "death-of-a-spreadsheet",
    "date": "January 11, 2019",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "“Training Issue” + “User Error” = Bad System Design",
    "content": "<!-- wp:paragraph -->\n<p>‘It’s a training issue’. ‘I’m\nafraid it’s user error’. We hear these justifications frequently in a customer\nservice environment when something goes wrong. But how often should we really\nbe attributing ‘user error’ to bad system design? </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Whilst it might be idealistic to\nsay that the right system can design-out all propensity for error, it’s\ncertainly true that systems can be used to minimise it. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The first step in reducing error\nis to measure complaints. Businesses need adequate reporting of complaints and\nthe ability to confidently diagnose issues. Root cause analysis can be used to\nhelp identify common themes. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Whilst it can be tempting to\ncategorise complaints as having a basis in ‘user error’, think about whether\nthe root cause is poor system design. If it is, putting issues in a ‘user\nerror’ bucket might just be glossing over more fundamental issues in your\nprocess. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>How can good system design\nhelp reduce ‘user error’? </h2>\n<!-- /wp:heading -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Invalid data entry or missing data</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Is your system permitting users\nto enter data in the wrong format? Can users submit records without entering\ndata in fields that should be mandatory? Are users selecting options and entering\ndata that isn’t relevant to the case or type of record? </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce Validation Rules can\nmake fields required and can prevent entry of data that is not compatible with\na defined rule. For example, if the validation rule allows a number between\n1-10, it will prevent entry of a value of ‘11’. These types of rule can also be\ndependent on other fields or the seniority of the user, making the application\nof validation rules very effective at controlling the quality of data. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Incorrect calculations or logic</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Are users expected to calculate\ntotals or grade records? Are they expected to remember different client\npreferences? Manual calculations can be an opportunity for error. Salesforce\nenables users to define calculated fields based on complex formulas, or a\nseries of formulas. Think about all ‘freehand’/editable fields in your system.\nIs there a way to drive a value, based on data that already exists in the\nsystem? </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Templates and automation </h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Does a certain type of customer\nrequest or input/event always require the same action or series of actions? If\nso, Salesforce Process Builder can be used to automate the process. Process\nBuilder can be used to send templated communications, send internal alerts,\ncreate tasks and create or update records based on field changes or customer\nonline requests. If processes aren’t suitable for full automation and require a\njudgment call, Salesforce can make it easy for your users to initiate a process\nwith a button click.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Providing training materials in context </h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Are ‘training issues’ arising in\nyour organisation on a regular basis? Is there a gap between the knowledge of\nsenior team members and new starters? </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Most organisations provide\ntraining on a periodic basis. We teach our users once, or once every six months\nand expect them to retain that information. For some, it’s difficult to\nunderstand and remember everything. Your team supervisors can become overrun\nwith questions; or worse, your team members guess the answer to their own\nquestions. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With Salesforce Knowledge, teams\ncan create and share Knowledge Articles and display these in the context of\ncertain records. Article creation can follow a process to ensure information is\ncorrect and Articles can be updated as necessary. Users can be presented with\n‘suggested articles’, based on the activity they’re completing within the\nsystem.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce Knowledge moves\norganisations away from expecting users to know and remember everything. With\ncontextual hints and suggestions, it’s like having a supervisor shadowing your\nteam members all the time. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Agile development using\nSalesforce</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Moving to Salesforce\napplications, or optimising Salesforce applications for your business can help\ndesign-out error in your organisation. There’s nothing more frustrating than\ncompromising customer relationships by repeating the same mistakes; especially\nif they seem easily avoidable. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>It’s not always reasonable to\nexpect team members to work to 100% accuracy; but you can apply that\nexpectation to an IT system. That’s why organisations should be constantly evaluating\nprocesses and determining whether work that’s carried out manually would be\nbetter automated (or at least partly automated).&nbsp; </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With Salesforce, users can\nquickly make those process changes. Salesforce users aren’t beholden to\nsoftware developers and protracted development timetables; they can take an\nagile approach to designing out error. Many Salesforce organisations look to\nmake monthly or quarterly releases to improve their systems and will look to\ntheir teams to propose and ‘upvote’ development changes; giving front-line\nusers the ability to influence the priority order of improvements. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For more information about\ndeveloping or customising Salesforce applications for your business, contact us\nusing the form below. </p>\n<!-- /wp:paragraph -->",
    "excerpt": "",
    "link": "https://appdraft.com/2019/03/19/training-issue-user-error-bad-system-design/",
    "type": "post",
    "slug": "training-issue-user-error-bad-system-design",
    "date": "March 19, 2019",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Why your sales team doesn’t use CRM",
    "content": "<!-- wp:paragraph -->\n<p>‘I’m too busy’. ‘I’m not great with computers’. ‘I’ve got my\nrolodex, I don’t need a CRM’. Salespeople are a tricky bunch. The great ones\nhave their idiosyncrasies and sales managers will often be inclined to overlook\nthem as long as the team delivers new business. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>But a good team is only part of the equation and good\nsystems can be just as important. So how do we achieve the holy grail of a good\nteam using a system that enables them to work even more effectively? It’s all\nabout objection handling. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Well-designed CRMs add value</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>‘What’s in it for me?’. It sounds a little mercenary, but if\nyou ask that question from your team’s perspective, you’ll be well on the way\nto improving user adoption. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A good place to start is saving time by reducing tedious and\nrepetitive tasks. Today’s sales professionals spend just 34% of their time\nselling. Introducing templated emails for the sales process, producing and\nsending templated proposals and contracts to prospects, tracking service\ndelivery and support cases; just a few ways a well-designed CRM can save users\ntime. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>It’s possible to automate just about any transactional\nprocess in Salesforce. The best designed systems will automate the ‘slack’; the\nthings your team shouldn’t be wasting their time on. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Make it indispensable&nbsp;&nbsp;&nbsp; </h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>If your CRM is <em>the </em>system\nof record for client information, if it holds clean and insightful data, your\nteam will be more inclined to use it. If you can use CRM as a place where group\nconversations about an account are hosted, your team will begin to use it as a\nplace of reference. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>If your CRM hosts revenue data by client (as opposed to just\npipeline data), think about using CRM to host commission summaries and\nperformance against target. Take a strict approach to deals ‘outside’ CRM;\ninsist that if it isn’t in CRM, it didn’t happen.&nbsp; </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Live reports, trend reports and dashboards within Salesforce\nare really powerful tools. If you’re manually exporting data and forcing it\ninto spreadsheets, you’re working from static data and introducing the\nopportunity for error. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Customise the user experience </h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>One size doesn’t fit all when it comes to systems. Typically,\norganisations will have a number of user types or ‘profiles’. All of those\nprofiles need an interface that works for them. If a user doesn’t use the\nfield, make sure it doesn’t take up valuable screen ‘real estate’. If you have\nproducts or services with different sales cycles, think about designing the\nuser experience around these. A well-designed CRM should be so intuitive that\nyou don’t need to be ‘good at computers’.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce Sales Cloud has the capacity to solve all these\nissues and more. Appdraft helps businesses implement and recalibrate Sales\nCloud to optimise it for their teams. With senior level ‘coal-face’ experience\nof sales and marketing, we work with organisations to review systems in the\ncontext of your process. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We’ll work with you to identify opportunities for automation\nand ensure that your CRM solves challenges for your team and becomes something\nthey are grateful for, instead of an admin chore. It’ll host clean, valuable\ndata and reporting that means something, allowing users to track progress live.\n</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Getting CRM right can be transformational for a business. By\ndeveloping ‘user stories’ we will understand what your users really want from a\nCRM and prioritise those changes to drive user adoption. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For more information on implementing Salesforce or\nrecalibrating your Salesforce org, contact us using the form below. </p>\n<!-- /wp:paragraph -->",
    "excerpt": "",
    "link": "https://appdraft.com/2019/02/19/why-your-sales-team-doesnt-use-crm/",
    "type": "post",
    "slug": "why-your-sales-team-doesnt-use-crm",
    "date": "February 19, 2019",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "White Paper: Achieving Digital Transformations with Low Code Development",
    "content": "<!-- wp:paragraph -->\n<p>\n\nHow 'low code' development and Platform as a Service infrastructure is helping businesses deliver connected, agile software applications\n\n</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:file {\"id\":1196,\"href\":\"/uploads/2019/04/DigitalTransformationswithLowCodeDevelopment-75-1.pdf\"} -->\n<div class=\"wp-block-file\"><a href=\"/uploads/2019/04/DigitalTransformationswithLowCodeDevelopment-75-1.pdf\">Digital Transformation with Low Code</a><a href=\"/uploads/2019/04/DigitalTransformationswithLowCodeDevelopment-75-1.pdf\" class=\"wp-block-file__button\" download>Download</a></div>\n<!-- /wp:file -->",
    "excerpt": "This paper is intended to set out how organisations can (and are) leveraging Low Code development on Platform as a Service (‘PaaS’) infrastructure to help expedite their digital transformation by delivering connected, intelligent business applications in a secure environment. ",
    "link": "https://appdraft.com/2019/04/20/white-paper-achieving-digital-transformations-with-low-code-development/",
    "type": "post",
    "slug": "white-paper-achieving-digital-transformations-with-low-code-development",
    "date": "April 20, 2019",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "The Salesforce Sales Cloud Top Five",
    "content": "<!-- wp:heading {\"level\":1} -->\n<h1>Appdraft's Top Five tips for making the most of Salesforce Sales Cloud!</h1>\n<!-- /wp:heading -->\n\n<!-- wp:heading -->\n<h2>Introduction</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>We’re setting out the top five areas of focus when getting value from Salesforce Sales Cloud. Whether you’re new to Salesforce or you’ve had it in place for a while, this is your guide to make sure Sales Cloud is working for you.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Automation</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Go back a few years and CRM systems were pretty much just a database for Accounts, Contacts and Opportunities.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>All the activities still happened in Outlook or Word and calls were dialled manually. These typically weren’t tracked in CRM or, if they were, they were aggregated in generic ‘notes’ sections.&nbsp;The amount of admin could be overwhelming.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Still today, the average Salesperson spends just 34% of their time selling - that represents huge inefficiency.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Sales Cloud can reduce this with automation, by stringing together a series of actions that would otherwise need to be manually created by salespeople.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>There is huge flexibility when looking at automation and the aim is to pursue the inefficiencies that you have in your current process. Here are some common examples of inefficiency and fixes that will help 'juice' the process and win back more time for sales activity:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\"id\":1918,\"sizeSlug\":\"full\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-full\"><img src=\"/uploads/2021/11/salesforcetopfive.png\" alt=\"\" class=\"wp-image-1918\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>We help businesses spot the areas of inefficiency and make proportionate suggestions as to how they can grease the wheels of the sales process.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The more you automate, the more time your team can win back to start doing more sales.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>One of the main reasons why CRM projects fail (and they do!) is that CRM system implementations don’t always ‘give back’ to users. If you expect your users to work with a new system, give them something to sweeten the deal; make their lives easier and help them devote more time to selling!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>The mobile experience</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>One of the great things about Salesforce is that it’s mobile ready. Everything you configure for desktop can be converted into a mobile experience.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>You can create leads when you’re out in the field or at events. There’s no longer any need to wait until you get back to the office; you can start to do admin like this in downtime for when travelling to and from events or meetings.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>It's even possible to access reports and dashboards on the go. All the MI you need is live and at your fingertips.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Automating the new customer journey</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The experience a potential client gets when trying to buy your product or service says a lot about your business. If you’re slow to produce proposal documents, prospects can lose interest and faith in your ability to treat them as a priority.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce can speed up the proposal process by generating .pdf Quotes, based on products or services selected from a version controlled Price Book; so you’ll never quote the wrong price or sell a product or service that you can’t deliver.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Once generated, proposals can be sent to the prospect by email. If the Quote needs to change, you can just update it and re-sync it with the Opportunity.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Need something more complex? There are Salesforce and AppExchange solutions for quotations, or just generic document generation options if this is all that’s needed. You can even integrate product catalogues or inventory through custom integration.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Once you’ve handled the Quote, send contracts via a digital signature application. Speeding up the contract execution process allows business to start supplying goods and services immediately, instead of waiting days for contract counterparts to arrive by post!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Automations like these starts the client relationship off on the right foot and means you close deals faster.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Integrations and data exchange</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Salesforce is very much an open platform. It’s designed to integrate easily with other software and to allow users to pull and push data from other platforms. Salesforce has modern Application Programming Interfaces or APIs that allow it to integrate with external systems.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>There are many possible applications for data integration. The most common integrations in the sales process are: </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li>Marketing systems to bring in new Leads</li><li>Billing systems to pull in data relating to actual sales (in order to rank Accounts or identify white space)</li><li>Data services to add additional contacts to Accounts or get Company data </li></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>Salesforce users also benefit from the AppExchange. There are applications and integrations for some of the most widely used business applications. AppExchange makes it easy to extend the functionality of your system</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Reports, dashboards and forecasts</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Management Information is where Salesforce adds real value. One of the key outcomes for any business implementing CRM is to help them get better information about their pipeline.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Although it might look complex, designing reports and dashboards in Salesforce is one of those 'fire and forget' things. Do it once and it will be there forever; you can just click refresh every time you need answers.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>You can get data on lead conversion rates by source, opportunity pipelines by user, team, product line, close date and anything else you need.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Forecasts offer a useful way of summarising Opportunity data by probability; with support for user hierarchies and ‘overviews’ (management adjustments to probabilities).</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The next step is using Salesforce Einstein analytics to provide AI-based insights; including scoring leads by likelihood of conversion, identifying which deals are likely to close and identifying opportunities to upsell to existing clients.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Getting MI right is really important. Whether you're tracking revenue, EBITDA or units sold, once you've identified the metrics, configuring the reports is easy and keeping track of performance is then as simple as clicking a button.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Conclusion</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Sales Cloud is a uniquely configurable product, which is one of the reasons why it’s the world's number one CRM system. But with great configurability comes great responsibility. Often businesses will subscribe to Sales Cloud with great intentions, only to end up using it simply as a database to track clients and deals.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>If you don’t take the time to configure the system and make the most of it, your users won’t see the value in it.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>If your users don't see the value in it, they won’t update it properly. Soon it becomes an expensive white elephant that does nothing for your business.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>If you think you might be in that position, it could be time to realign your CRM with the business needs and make sure you’re making the most from it.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With a little bit of thought, design and configuration you can produce a system that your team will benefit from; a system that they will want to use.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>It will save them time and give you the answers you need. It will also give you a better understanding of your clients; what are they’ve bought what they haven't bought (yet). A well optimised CRM really can provide that 'Holy Grail' 360-degree view of the customer.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Appdraft can help you identify the right features, the features that will add value for your business right now and those that you might want to consider in the future.&nbsp;</p>\n<!-- /wp:paragraph -->",
    "excerpt": "Top tips for making the most of Salesforce Sales Cloud; including leveraging automation, mobile experience and integrations. \n\nThe things no Salesforce Sales Cloud instance should be without!",
    "link": "https://appdraft.com/2021/10/27/salesforce-sales-cloud-top-five-features/",
    "type": "post",
    "slug": "salesforce-sales-cloud-top-five-features",
    "date": "October 27, 2021",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Predictive Analytics: The Credit Manager’s Crystal Ball",
    "content": "<!-- wp:paragraph -->\n<p>Wouldn’t it be great if we could accurately identify which customers or prospects are going to default? We would be able to refuse or restrict credit terms and prevent the businesses we represented from being stung by insolvency. We would be nothing short of psychic credit superheroes! But is it possible?&nbsp;&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Unless you’ve been living under a rock, you’ll have heard of the rise of predictive analytics. If you’re already using credit reports and relying on credit scores, you’ll be using predictive analytics to some extent.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>What is predictive analytics?</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Predictive analytics are based on algorithms. Algorithms determine the patterns in data and their relative importance in establishing a decision or outcome. In the context of credit reports, an algorithm will determine the credit score assigned to a business or individual and the integrity of that scoring will be based on the quality of the algorithm.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This is the reason why we might have differing views about the quality of credit reports we subscribe to. It all depends on the algorithm; how comprehensive it is and how relevant it is to our business.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Clearly, using credit reports as part of a diligence process is important, but can a business improve upon the predictive integrity by adopting its own approach to predictive analytics. Can it outperform the credit reference agencies?&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Building your own (accurate) algorithm is the holy grail of risk management</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The answer is yes, at least in theory. Each business will have its own idiosyncrasies in its customer base. A business might have a bias towards customers in a particular geographic region or industry. It may tend to serve businesses of a certain age or size. This is important because it has an impact on the relevance of algorithms. For example, some credit reference agencies will lower a credit score when directors resign from a company. Whilst this might be very relevant for SME’s (where the loss of a director can be critical), it is less relevant for large enterprises. As a consequence, if you’re doing business exclusively with large enterprises, director resignations may have little or no significance to your credit risk.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Also, whilst credit reference agency data is undoubtedly important, so is the wealth of data you hold (although only if you’re actually making use of it!).&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>As any episode of CSI will tell you, one of the biggest predictors of the future is relevant past behaviour. If you have years of payment data in your organisation, you should be able to use that to predict who will pay late, who needs chasing (and to what extent) and even insolvency events.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>So what are typical ‘insightful’ indicators?. Here are just a few:&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li>Number of late payments in the last 90, 120 and 360 days</li><li>Payment method and changes in method</li><li>Industry/SIC Code</li><li>Size of invoice</li><li>Current balance vs credit limit</li></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>There can be other, less obvious indicators; producing patterns that only data-mining software can identify.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Introducing Salesforce Einstein </h2>\n<!-- /wp:heading -->\n\n<!-- wp:media-text {\"mediaId\":1909,\"mediaLink\":\"https://www.appdraft.com/blog/2019/08/15/predictive-analytics-the-credit-managers-crystal-ball/einsteinsmall/\",\"mediaType\":\"image\",\"mediaWidth\":17,\"mediaSizeSlug\":\"medium\"} -->\n<div class=\"wp-block-media-text alignwide is-stacked-on-mobile\" style=\"grid-template-columns:17% auto\"><figure class=\"wp-block-media-text__media\"><img src=\"/uploads/2019/08/einsteinsmall-300x300.png\" alt=\"\" class=\"wp-image-1909 size-medium\"/></figure><div class=\"wp-block-media-text__content\"><!-- wp:paragraph {\"placeholder\":\"Content…\",\"fontSize\":\"large\"} -->\n<p class=\"has-large-font-size\"><meta charset=\"utf-8\">Using <a href=\"https://youtu.be/wo9IUWQb6oU\">Salesforce Einstein</a> Prediction Builder, users can very quickly build data models that can assign a probability score for late payment and critical default. Once data is housed on the platform, building predictions is simple. Prediction indicator fields can then be used to produce alerts or help prioritise accounts for credit control calls or credit limit reviews. </p>\n<!-- /wp:paragraph --></div></div>\n<!-- /wp:media-text -->\n\n<!-- wp:paragraph -->\n<p>Using Salesforce Einstein Prediction Builder, users can very quickly build data models that can assign a probability score for late payment and critical default. Once data is housed on the platform, building predictions is simple. Prediction indicator fields can then be used to produce alerts or help prioritise accounts for credit control calls or credit limit reviews.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Einstein Prediction Builder forms part of a much larger use case for Salesforce, which includes automating dunning cycles, allowing customers to view and manage online accounts and live KPI dashboards.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For more information on predictive analytics for credit managers, contact <a href=\"mailto:adam.wonnacott@appdraft.com\">adam.wonnacott@appdraft.com</a>.&nbsp;<br></p>\n<!-- /wp:paragraph -->",
    "excerpt": "Wouldn’t it be great if we could accurately identify which customers or prospects are going to default? We would be able to refuse or restrict credit terms and prevent the businesses we represented from being stung by insolvency; we would be nothing short of psychic credit superheroes! But is it possible?  ",
    "link": "https://appdraft.com/2019/08/15/predictive-analytics-the-credit-managers-crystal-ball/",
    "type": "post",
    "slug": "predictive-analytics-the-credit-managers-crystal-ball",
    "date": "August 15, 2019",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "87% of credit managers admit systems automation would increase efficiency",
    "content": "<!-- wp:paragraph -->\n<p>A multinational study by the Chartered Institute of Credit Management and Dun &amp; Bradstreet has found that 87% of respondents believe automation will improve the efficiency of their team in the next three years; but most have made little progress towards their digital transformation goals.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Key findings from the study were as follows:&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li>Eighty-three percent (83%) of respondents are currently using some form of automation; </li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>62% of respondents are automating less than a quarter of their processes;</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Billing (43%), credit scoring (36%), reporting (30%) and collections (30%) are the most often automated processes </li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>Operational efficiency was seen as a key driver for automation, with 68% of respondents citing time efficiencies and 55% citing cost savings as key drivers.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The biggest barriers to automation were: integration of multiple systems/tools (32%); winning budget (26%) and managing disparate data (15%).</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>“Comprehensive and reliable data was identified as critical to effective automation,” said Tim Vine, European Head of Finance Solutions for Dun and Bradstreet.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Philip King, CEO for the <a href=\"https://www.cicm.com/\">CICM</a> gave the following comment:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:quote -->\n<blockquote class=\"wp-block-quote\"><!-- wp:paragraph -->\n<p>Implementing successful automation is about employing the right technology to complement specific credit management functions and skills. A principal task of a credit manager is to avert the risk of non-payment, and automation can certainly assist in this task, with the understanding that human intervention based on experience and knowledge will always be required within processes.</p>\n<!-- /wp:paragraph --></blockquote>\n<!-- /wp:quote -->\n\n<!-- wp:paragraph -->\n<p>The study leaves little room for doubt that automation will play an important part in improving operational efficiency in credit management in the months and years to come. The challenge for the 87% is how to achieve that change and what the catalyst will be.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Perhaps most interesting is the data concerning the challenges or roadblocks relating to change. Let’s look at these in turn:&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Budget</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Budget will always be a challenge, but most CFOs will soon identify value in automation with a well-structured business case laying out investment, cost-savings and a short payback period. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Cost savings need not always mean headcount reductions; it could simply mean lower headcount growth or freeing up resources so that businesses need to outsource less. Most people underestimate what’s possible in terms of automation and consequently the level of achievable operational efficiency. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Many credit managers are jaded by previous experiences with never-ending ERP development projects; with the assumption being that anything not ‘out of the box’ is expensive and takes an age to develop. That’s no longer true with low code platform development on ‘Platform as a Service’ infrastructure.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Integrating systems and tools</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Another misconception is that it’s difficult to integrate systems. This can be true if a business is seeking to extract data from older ‘on premise’ systems, but many cloud-based systems have modern Application Programming Interfaces (‘APIs’) that make connectivity much easier. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Even the oldest of systems will allow the export and import of data and this can be scheduled to run automatically. Dependent on the number of systems you’re using, choosing the right platform and building functionality in one place can actually help streamline the number of software programs your team are subscribing to (and reduce cost).</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Managing disparate data</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>This feels like part of the wider fear about integration. Not having a ‘source of truth’ for customer data in an organisation can cause real challenges. Changing and working with data in multiple systems, without syncing those changes, can make it almost impossible to read across systems; which leads to error and customer disappointment. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This challenge is unavoidable and overcoming it is part of good system design. Starting with a flexible, highly-customisable platform that is <em>designed</em> to integrate well with other systems is the first step to conquering this.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Summary</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>In summary, most credit managers see automation as something desirable, but it can be difficult to know where to begin. The common assumption is that automation through system design is expensive and disruptiveto business. Whilst this was once true, it no longer has to be the case when taking an agile approach with ‘low code’ development.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>It’s possible to begin delivering operational systems that automate parts of a process within a matter of 2-3 months; which means much lower consultancy costs and lower project risk. Making changes in a low code development environment is much easier too!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>There is huge opportunity in automation. It takes the mundane parts out of processes, allows teams to become massively more efficient and helps reduce errors that cause complaints. Good systems will also support live reporting and alerts to help managers keep a finger on the pulse of the business - instead of periodic reporting. &nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>So if you’re in the 87%, remember there’s no time like the present!&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:separator {\"opacity\":\"css\"} -->\n<hr class=\"wp-block-separator has-css-opacity\"/>\n<!-- /wp:separator -->\n\n<!-- wp:paragraph -->\n<p>Original article and source data: <a href=\"https://www.cicm.com/reliable-data-identified-key-successful-automation/\">https://www.cicm.com/reliable-data-identified-key-successful-automation/</a></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Credit and thanks to the Chartered Institute of Credit Management and Dun &amp; Bradstreet<br></p>\n<!-- /wp:paragraph -->",
    "excerpt": "87% of respondents in a recent D&B / CICM survey believe automation will improve the efficiency of their team in the next three years; but most have made little progress towards their digital transformation goals. ",
    "link": "https://appdraft.com/2019/08/22/study-finds-87-of-credit-managers-admit-systems-automation-would-increase-efficiency/",
    "type": "post",
    "slug": "study-finds-87-of-credit-managers-admit-systems-automation-would-increase-efficiency",
    "date": "August 22, 2019",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "The many reasons spreadsheets are not your friends",
    "content": "<!-- wp:heading {\"level\":3} -->\n<h3><meta charset=\"utf-8\">This article was published in the <a rel=\"noreferrer noopener\" href=\"https://yumpu.com/en/document/read/62837072/credit-management-october-2019\" target=\"_blank\">October 2019</a> Issue of Credit Management magazine. Image reproduced with permission and thanks to the Chartered Institute of Credit Management and the CM Magazine editorial team. </h3>\n<!-- /wp:heading -->\n\n<!-- wp:image {\"id\":1901,\"sizeSlug\":\"large\",\"linkDestination\":\"none\",\"style\":{\"color\":{}}} -->\n<figure class=\"wp-block-image size-large\"><img src=\"/uploads/2021/11/Wordpress-Post-Featured-Image-1-1-1024x536.png\" alt=\"\" class=\"wp-image-1901\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>Industry is rife with supposition about the way technology will change how we work. AI, robots, machine-learning; it all sounds a little far-fetched, especially when you look at the day-to-day reality of credit control and collections. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Many internal collections departments are working with a proliferation of spreadsheets or tired databases. Spreadsheets for managing cases, spreadsheets for reporting; layers of spreadsheets connected to other spreadsheets or database tools that are no longer fit for purpose. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>What’s wrong with spreadsheets? As the old adage goes, ‘if it ain’t broke, don’t fix it’. The answer to this lies in your attitude towards change and continuous improvement. If you’re still reading this article, it’s likely you’re the sort of person that consistently seeks to improve the way you and your function operate. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>As an industry, some early adopters are starting to leverage really impactful technology in the collections process. Perhaps most important is the applications of ‘big data’ (the ability for systems to quickly scan large swathes of data and identify patterns). Also key, is the ability to program systems to act on that data or present a user with suggestions as to how they might want to proceed. This is the essence of ‘big data’, ‘robots’, ‘AI’ and all the other confusing synonyms for what are simply faster, more capable systems. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>What are we trying to achieve with technological change?</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>What are we trying to achieve with technology-driven changes like this? At a high level, the potential advantages can be summarised as follows:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li><strong>Customer Experience</strong> – Automation brings standardisation. Computers accept inputs and generate outputs, instantly. For many transactional interactions this is what customers expect. As customers in the modern age, we don’t tolerate delays well; especially when we’re asking for something simple. We also don’t tolerate error. Our expectations have been shaped by our experiences with online shopping and online banking. We expect transactional experiences to be quick and accurate and we expect prompt and helpful human support when we have complex requests or something goes wrong. </li></ul>\n<!-- /wp:list -->\n\n<!-- wp:list -->\n<ul><li><strong>Efficiency</strong> – Shareholders and investors (and accordingly CFO’s) are always looking for efficiency. We’re expected to do more with less (or, if we’re lucky, more with the same). As explained above, automation helps businesses automate transactional tasks. Allowing applications to take the strain frees up resource. It helps staff focus on complex tasks and better serve customers, whilst doing more rewarding work. It also means less error and loss. </li></ul>\n<!-- /wp:list -->\n\n<!-- wp:list -->\n<ul><li><strong>Insight</strong> – Most of our spreadsheets are designed to provide us with insight and help us make decisions, based on current (or, more likely, recent) data. With increased processing power, predictive analytics can tell us (within a defined level of confidence) what is going to happen next month or next quarter. The power of this cannot be underrated. The ability to predict default or insolvency, or to predict cashflow is an incredible advantage; so too is the ability to resource on the basis of predicted workload. </li></ul>\n<!-- /wp:list -->\n\n<!-- wp:list -->\n<ul><li><strong>Connectivity</strong> – Better systems help us connect with our customers, our debt recovery partners, our data partners in a way that reduces friction. With customer or partner portal services, third parties can begin to ‘self-serve’ and help creditors reduce the level of noise associated with simple enquiries. Connectivity also relates to the ability to consume data from third parties. With the wave of ‘digital transformation’, most organisations are developing Application Programming Interfaces (APIs) to help customers consume their data or services. A good example is the use of APIs in provision of credit risk data; where organisations can automatically receive information from credit reference agencies, fuse this with payment history data, and generate a risk level (or alert, if appropriate).  </li></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2>How accessible are these new technologies?</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>So far, so good. All this sounds great and it’s undoubtedly something that can really help, or even transform, most businesses; but is it really achievable for a majority of businesses? </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Our past experiences inform our thinking and, if you’ve ever been involved in an ERP or other large-scale IT project, you’ll know how all-consuming and disruptive it can be. It can also be very expensive, with projects routinely running for several years. By the time the project completes, the requirements have almost always changed and the sense of relief at completing the project is something even the most ambitious Product Owner never forgets and never wants to repeat. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>But just as the capabilities of systems have changed, so has the method of development. More and more businesses are moving towards cloud-hosted ‘platform as a service’ (or ‘PaaS’) technologies. PaaS platforms allow developers to use modular, standardised code to quickly develop functionality, often through ‘low code’. Working in a low code platform means that there is less code to write, test and inevitably change. Low code permits iterative improvements to systems, allowing organisations to change functionality as a project progresses. PaaS platforms also readily integrate with external software or data providers. For example, several PaaS platforms now have bolt-ons for integration with large accounting packages. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Development on PaaS platforms tends to use Agile methodology. With a focus on developing a ‘minimum viable product’ as soon as possible and then iteratively improving, the development timeframe is reduced considerably. A Forrester™ study on low code development estimated that it is between 6-20 times faster than traditional coded development techniques. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>The reality of digital transformation</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>In conclusion, once we begin to cut through some of the buzzwords and ethereal concepts like ‘Artificial Intelligence’ and ‘Digital Transformation’, it’s easy to appreciate that there is real value and opportunity in rethinking our use of technology. With the current pace of change in technology, all businesses will need to start planning if they are to remain at all competitive over the course of the next decade or two.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>PaaS development helps businesses quickly leverage new technology as platform providers fight amongst each other to bring their users transformational functionality that they can bake into their systems. With the benefit of Agile development and the integration capabilities of PaaS applications, businesses don’t need to have a clear picture of an ‘end goal’. Rather, they can take a targeted, but iterative approach; working on the processes that represent the biggest potential for improvement. If you are looking for ‘low hanging’ fruit that are ripe for digital transformation, a great place to start is by considering where (and why) you use spreadsheets. Invariably, processes that are supported by spreadsheets can be positively transformed by well-designed systems. </p>\n<!-- /wp:paragraph -->",
    "excerpt": "People love spreadsheets. They're a comforting way to push data around and track changes. BUT, there are many reasons why spreadsheets don't work beyond the most basic of use cases. Here's why we shouldn't be afraid to shake off the limitations of spreadsheets and move towards a database structure. ",
    "link": "https://appdraft.com/2019/10/01/whats-wrong-with-a-spreadsheet/",
    "type": "post",
    "slug": "whats-wrong-with-a-spreadsheet",
    "date": "October 1, 2019",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "One less thing to worry about: A robot apocalypse",
    "content": "<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Artificial Intelligence is a tricky concept to grasp. In order to ‘dumb down’ the conversation, commentators often resort to talk of robots; robots that can do the job of our colleagues and possibly even replace <em>us</em> in the workplace.&nbsp;</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>It’s a scary concept, made more so by the use of unhelpful terminology. But what’s the reality and how worried should we really be?</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Productivity improvement through technology is nothing new</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Let’s rewind to a world before emails and before today’s modern PCs replaced our ‘word processors’. For some, these were the glory days. Letters were dictated and there was no such thing as instant communication; expectations were lower. Diaries weren’t shareable, which meant less accountability. If you were important enough, you had a PA or even a ‘secretary’ to fend off those pesky meeting requests. Working life had its own pace.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Fast-forward to today. The expectation is super-charged. In the last 20 years we have been bombarded with productivity tools. We’re instantly contactable by email, people expect an instant response and our colleagues and bosses can see whether we’re really busy (or just good at looking busy) by checking our online calendar. The typing pool and the post room have gone as technology has ‘empowered’ us and allowed us to become more self-sufficient.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Of course PCs, email and spreadsheet software are not robots, they are just productivity tools; things that help us work much more efficiently (whether we want to or not).&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>‘Artificial Intelligence’ or ‘robotics’ is just a continuation of this. It involves programming software to do the repetitive and predictable tasks that you do regularly. In all roles there will be a proportion of tasks that are ripe for automation. Typically these involve templating communications, streamlining approval processes, triggering workflows, facilitating self-service and (perhaps the biggest time-vortex of all) preparing reports.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Today’s technology also allows us to use software to identify patterns in data (so we don’t have to) and can suggest ‘best next steps’ or generate forecasts. That said, we’re a big step away from fully-autonomous, decision-making ‘robots’ that can do our jobs for us becoming the norm. Whilst using software to identify patterns means we don’t have to, it often needs the checks and balances of a human to ensure that the results aren’t biased or influenced by ‘false positives’.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>As such, the idea of technological advancement in the workplace is not new. We have been in that process for decades.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Cloud computing power is a step-change</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The difference, arguably, is that low-code automation technologies are becoming increasingly accessible. With the development of cloud computing and the ability to exploit cloud servers for the technological ‘heavy lifting’, the financial and time investment required to leverage these services is lower than ever.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>So is the threat (or promise) of these technologies replacing us any more real as we hit the Twenties? Yes. Should we be worried? Possibly. Most readers of this article will be in a role that requires some element of complex decision making or utilisation of people skills (working with clients or managing colleagues). To that extent, those responsible for complex processes are likely to be insulated from an element of the change that will happen over the next 20-30 years.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>People engaged solely in more ‘<a href=\"https://www.forbes.com/\">transactional’ tasks</a> are, however, likely to find it increasingly difficult to find employment. That threat poses challenges at a macro level that we shouldn’t ignore. When we gradually create a society of people who have nothing to do but watch daytime TV (but through no fault of their own and with no viable alternative), someone will need to pay. We’ll also need to ensure that those people don’t become disenfranchised or politicised as ‘second class’. We’ll need to work on our capacity for altruism instead of laying blame. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For those of us lucky (or unlucky?) enough to be part of the employed population, we’ll be able to automate much of the stuff that is most repetitive and least rewarding about our jobs. The concept of ‘month end’ reporting will become a thing of the past and we’ll have more time to focus on tasks that are more complex or demand our interpersonal skills.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The most important point to bear in mind is that we’re on a journey. The landscape will change again as cloud servers become ever more powerful and communication speeds improve. So, as much as there is cause for concern, there is cause for excitement and anticipation of what will become possible in the years to come.&nbsp;</p>\n<!-- /wp:paragraph -->",
    "excerpt": "Should you be worried about robots stealing your job? 'Robots' are an emotive epithet; is this just a continuation of a theme of efficiency driven by technology?",
    "link": "https://appdraft.com/2021/10/15/one-less-thing-to-worry-about-a-robot-apocalypse/",
    "type": "post",
    "slug": "one-less-thing-to-worry-about-a-robot-apocalypse",
    "date": "October 15, 2021",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Email Integration in Salesforce",
    "content": "<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>There are several different options available for sending email via Salesforce.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>'Send Email from Salesforce Servers'</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>If you’re not up for any integration at all, then sending emails from Salesforce, via the Salesforce servers, is the option for you.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The downside of this approach is that because emails derive from Salesforce's servers and not your organisation, there is a risk that your recipient email servers will identify this and send your email to Spam folders. In practice, whether the email is flagged will depend on the recipient and how they treat email from generic sending domains, like those used by Salesforce. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Integration with Outlook 365 or Gmail</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The other most popular alternative is to configure a Gmail or Office 365 integration for your users. Once this is set up at the organisation level, users will need to sign in to their email through Salesforce to connect their accounts.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The advantage of integration is that you can configure a sidebar inside Gmail/Outlook to associate emails from your inbox to Salesforce records. You can search for Contacts and Accounts straight from your email program and associate emails with them to build a comprehensive history of conversations with your customers.&nbsp;&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Salesforce Inbox</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Salesforce Inbox is an additionally chargeable solution that makes it easier for users to work with email on mobile devices. Leveraging the Outlook/Gmail integrations, Salesforce Inbox is essentially a smart email ‘client’ for mobile. Inbox brings another level of intelligence and will ‘read’ emails and provide helpful tags for surfacing important emails, like requests for pricing.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Save time by using templates, list emails and automation</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Once you’ve configured email, you'll be able to email straight out of Salesforce and, importantly, to start leveraging email templates. Email templates are a great way to reduce time spent on repetitive tasks (think ‘chaser’ emails or sales outreach emails!). Users can set up their own templates and leverage fields from the object that the email is being composed from, e.g. ‘Name’ fields from Contact records.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>You can use Salesforce to send emails to groups of contacts or leads, via Campaigns and you can configure email alerts to be triggered when certain changes are made to your records or as part of a process. A practical example of this might be an email alert to a new customer when terms are authorised.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Triggering actions in Salesforce when new emails arrive</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>But what if you want to do something other than just associate a new inbound email with a record? For example, you might want to create a lead or a new support case when a new email is sent to one of your generic email addresses. Specific email 'handlers' can parse inbound emails and trigger the creation or update of one or more records, as well as alerts to users. Pretty much anything is possible!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>It’s worth bearing in mind that your ability to do some of the above will depend on your version of Salesforce and your version of Outlook, so check these first before making a commitment!</p>\n<!-- /wp:paragraph -->",
    "excerpt": "Brief explainer of the options available in Salesforce for integrating email",
    "link": "https://appdraft.com/2021/11/21/email-integration-salesforce/",
    "type": "post",
    "slug": "email-integration-salesforce",
    "date": "November 21, 2021",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Salesforce Showcase: Salesforce + Xero Integration",
    "content": "<!-- wp:paragraph -->\n<p>Xero is one of the most popular accounting apps for SME's. Salesforce Sales Cloud is the world's number one CRM. What happens when you combine the two? At the very least, you can expect the Sales teams to be able to focus their efforts more strategically on the right clients; but the sky's the limit!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Check out this video to get an idea of what's possible and reach out to <a href=\"mailto:info@appdraft.com\">info@appdraft.com</a> for any further help or advice on Salesforce integrations!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:embed {\"url\":\"https://vimeo.com/665133497\",\"type\":\"video\",\"providerNameSlug\":\"vimeo\",\"responsive\":true,\"className\":\"wp-embed-aspect-16-9 wp-has-aspect-ratio\"} -->\n<figure class=\"wp-block-embed is-type-video is-provider-vimeo wp-block-embed-vimeo wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\nhttps://vimeo.com/665133497\n</div><figcaption>Xero and Salesforce Integration</figcaption></figure>\n<!-- /wp:embed -->\n\n<!-- wp:separator {\"className\":\"is-style-wide\"} -->\n<hr class=\"wp-block-separator is-style-wide\"/>\n<!-- /wp:separator -->",
    "excerpt": "",
    "link": "https://appdraft.com/2022/01/12/salesforce-showcase-salesforce-xero-integration/",
    "type": "post",
    "slug": "salesforce-showcase-salesforce-xero-integration",
    "date": "January 12, 2022",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "An Exact Science: Forecasts in Salesforce",
    "content": "<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Forecasts are something of an afterthought for most Salesforce implementations. The focus for new CRM users tends to be on giving users a tool to ‘manage’ the Sales process. Reporting and tracking sales metrics is often less of a priority; but it really is essential at a strategic level for businesses that are serious about growth.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Forecasts are a ‘ready made’ reporting tool for Opportunities. They allow users to view open opportunities that are set to close during the forecast period (which is customisable) and sliced by month or quarter. Rather than reflecting the various (and many) opportunity ‘stages’ that are configured for your instance, forecasts use ‘Forecast Categories’ to summarise the status of the opportunities more broadly.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Forecasts will provide a view based on categorisations like ‘Closed’, ‘Commit’ or ‘Best Case’; allowing users to quickly get a handle on which opportunities are ‘real’.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Forecasts are based on a user hierarchy, which supports team-based working and ensures that users only see their opportunities and the opportunities of their direct reports.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>When reviewing forecasts, users can quickly edit values ‘on the fly’; making forecasts a perfect tool for collaborative review sessions. Managers can use forecasts to quickly scan through and sanity-check opportunities with their team and make edits to the amount or close date (and other fields) as required.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:block {\"ref\":2071} /-->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Quotas</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Quotas are effectively a ‘bet’ (usually an educated guess!) as to the revenue that a business will generate over the forecast period. They are an essential part of budgeting for mature businesses that target growth.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Quotas in Salesforce allow managers to define a split of organisational revenue across the team members. You can split the amount equally by users or, more likely, based on prior performance.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Whilst businesses are often nervous about devising quotas, they are an essential part of setting intention. Budgets and quotas will often be wrong, but it's better to guess than to omit to go through the process at all.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\"id\":2065,\"width\":1025,\"height\":291,\"sizeSlug\":\"large\",\"linkDestination\":\"none\",\"align\":\"center\"} -->\n<figure class=\"wp-block-image aligncenter size-large is-resized\"><img src=\"/uploads/2022/01/143066e1291173b4907b9d6b7a55ec6e_forecasting-configuring-types-4-1024x291.jpeg\" alt=\"\" class=\"wp-image-2065\" style=\"width:1025px;height:291px\"/><figcaption class=\"wp-element-caption\">forecast view in Salesforce</figcaption></figure>\n<!-- /wp:image -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Adjustments</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Adjustments are a way of providing context on the certainty of the pipeline, without necessarily challenging the detail of the underlying opportunity. It’s not uncommon for users to tend towards an optimistic or a pessimistic outlook when it comes to setting the opportunity amount or close date.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For the self-aware user, there is the option to dial up or dial down their own forecast, based on what they know about their typical forecast versus historic actuals. More typically, the adjustment process is something that a line manager will undertake before reporting the forecast to more senior managers.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:block {\"ref\":2071} /-->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Reports</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Forecasts can be used as a reportable object in the standard reports and dashboards tool, giving users the ability to see forecasts represented graphically.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:block {\"ref\":2071} /-->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Hot off the press!: Spring 2022 Release changes to Forecasts</h2>\n<!-- /wp:heading -->\n\n<!-- wp:image {\"id\":2064,\"width\":999,\"height\":473,\"sizeSlug\":\"full\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-full is-resized\"><img src=\"/uploads/2022/01/fce99ac7ac9deab1d81a7971f99ca08b.png\" alt=\"\" class=\"wp-image-2064\" style=\"width:999px;height:473px\"/><figcaption class=\"wp-element-caption\">new tracked changes to forecasts </figcaption></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>The Spring ‘22 release of Sales Cloud brings some updates to Forecasts, including:&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li>Quota Gap - The ability to easily see the difference between Quotas and the current forecasted amount</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Show Changes - The ability to view changes to the forecast in the last 7 days. This feature is a great way to track recent changes, particularly when using Forecasts as a team discussion artefact&nbsp;</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Exclude Opportunities - This new feature allows businesses to exclude certain types of Opportunities, e.g. ‘renewal’ or existing business&nbsp;</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:block {\"ref\":2071} /-->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Summary</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The value of forecasting can’t be understated. It doesn’t necessarily need to be something that is exclusive to large organisations; it’s good practice for all businesses.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Forecasting in Salesforce is a great way to collaborate around revenue predictions. If your users know that Salesforce is the ‘source of truth’ for pipeline, they are more likely to ensure accuracy.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With the new improvements, Forecasts are a fantastic tool and something to leverage wherever possible.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For help and advice on implementing forecasts (and everything else Sales Cloud), contact <a href=\"mailto:info@appdraft.com\">info@appdraft.com</a></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:separator {\"opacity\":\"css\",\"className\":\"is-style-wide\"} -->\n<hr class=\"wp-block-separator has-css-opacity is-style-wide\"/>\n<!-- /wp:separator -->",
    "excerpt": "Sales Forecasts help businesses understand how they're tracking against revenue expectations. \n\nThe Forecast and Quota tools in Salesforce Sales Cloud are some of the most under-used but effective tools in the Sales Cloud suite. \n\nThis article looks at Forecasts in detail, together with some recent advancements in the Salesforce Spring '22 release.  ",
    "link": "https://appdraft.com/2022/02/01/an-exact-science-forecasts-in-salesforce/",
    "type": "post",
    "slug": "an-exact-science-forecasts-in-salesforce",
    "date": "February 1, 2022",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Getting It Right First Time: The Value of Salesforce Consulting Partners",
    "content": "<!-- wp:paragraph -->\n<p>Salesforce Consulting Partners are independent, authorised experts that help customers make the most of Salesforce.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce is uniquely customisable and offers real flexibility for businesses to design the platform around evolving needs and future-proof their CRM. Whether your team is 10 or 10,000-strong, Salesforce will help you deliver both current and future business objectives.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Consulting Partners help customers identify and surface the CRM features that are right for your business today, whilst helping you plan to leverage the more complex capabilities of the system as your business scales.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Here are some key themes for CRM project success:</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>The Sales Process</h2>\n<!-- /wp:heading -->\n\n<!-- wp:image {\"id\":2089,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-large\"><img src=\"/uploads/2022/02/processmap2-1024x427.png\" alt=\"\" class=\"wp-image-2089\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>Defining the Lead and Opportunity management process is hugely important if a business is seeking to standardise the categorisation of data. All sales people are different and some are more optimistic than others when it comes to setting Opportunity Stages and values. To achieve reliable data, the business needs to configure the system to standardise the user input. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Things to think about:</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li>How will Lead data be imported and what does the Lead conversion process involve?</li><li>What Stages will an Opportunity proceed through and how can the business enforce system rules to prevent Opportunities advancing through Stages without the proper assessment or qualification?</li><li>How can Opportunity value be qualified so that it is tied to what the Customer intends to purchase (so that the business doesn’t have to rely on Sales team estimates?)</li></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2>Data Management</h2>\n<!-- /wp:heading -->\n\n<!-- wp:image {\"id\":2090,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-large\"><img src=\"/uploads/2022/02/datatransfer-1024x427.png\" alt=\"\" class=\"wp-image-2090\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>Maintaining valid and complete data in a system is essential. All systems should be an effective reference point and source of truth for<br>customer data. If data is inaccurate or missing, users will quickly lose trust.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Things to think about:</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li><meta charset=\"utf-8\">How will data be migrated from a legacy system into Salesforce; is there a requirement to clean/validate that data?</li><li>How can duplicate records be prevented or actively managed/merged?</li><li>How can the business enforce required fields and ensure that users only add data that conforms with business expectations?</li></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2>Reporting</h2>\n<!-- /wp:heading -->\n\n<!-- wp:image {\"id\":2092,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-large\"><img src=\"/uploads/2022/02/Untitled-design-27-1024x427.png\" alt=\"\" class=\"wp-image-2092\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>Reporting is often an after-thought for new CRM users, who tend to focus on the benefits of process management. Effective reporting (assuming reliable data) can help businesses answer fundamental questions about performance, including:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li><meta charset=\"utf-8\">What is the business cash position likely to be in the next ‘X’ months; is the business tracking to budget?</li><li>Who are the key customers?; who are the Rising Stars and who is scaling back their spend? </li><li>Which products/services are best-sellers? </li><li>Which products haven’t key customers bought? </li><li>Which team members perform best? What activities are they undertaking that ‘shift the needle’?</li><li>What Lead sources are converting into valuable Opportunities?</li></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>Answering these questions effectively and confidently sets a business up for success. Many businesses rely on spreadsheets and data exports for reporting. The time-consuming nature of manipulating data in this way means reporting often becomes an occasional/infrequent task that takes up considerable management time. Reports and Dashboards in Salesforce allow users to ‘set and forget’ on KPI tracking and simply refresh the live data at the click of a button to take the pulse of the business.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Payback: The key to user adoption</h2>\n<!-- /wp:heading -->\n\n<!-- wp:image {\"id\":2093,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} -->\n<figure class=\"wp-block-image size-large\"><img src=\"/uploads/2022/02/payback-1024x427.png\" alt=\"\" class=\"wp-image-2093\"/></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>New system implementations need to be more carrot than stick. For most users, system change is rarely welcome and busy sales people often don’t have time to adjust. To soften the blow, businesses should give consideration to the following:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li>Can users lives be made easier by automating processes, e.g. quote or contract creation?</li><li>Can activities in email and LinkedIn be integrated, so that users have a complete picture of their conversations with Leads and Contacts in one place?</li><li>Can authorisation or sign-off processes be made quicker so that users don’t have to write emails for permission or wait for/chase responses?</li></ul>\n<!-- /wp:list -->",
    "excerpt": "Based on several studies over the past 20 years, around 50-70% of CRM projects fail. \n\nGetting it right isn't easy; which is why Salesforce Consulting Partners like Appdraft exist. Here are just a few examples of the complexities that you'll need to tackle; whether or not you're into DIY!  ",
    "link": "https://appdraft.com/2022/03/05/getting-it-right-first-time-the-value-of-salesforce-consulting-partners/",
    "type": "post",
    "slug": "getting-it-right-first-time-the-value-of-salesforce-consulting-partners",
    "date": "March 5, 2022",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "From Poacher to Gamekeeper : Building a Career in Salesforce",
    "content": "<!-- wp:paragraph -->\n<p>Having just achieved my 10th Salesforce Certification, Application Architect, I wanted to share a little about why I chose Salesforce consulting as a career change and what I learned in the process. If you’re working in sales and thinking about a career change to Salesforce, I hope it helps and if you want any advice, feel free to DM me on LinkedIn!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Having worked in sales for 13 years before deciding on a career in Salesforce consulting, I’d had first-hand experience of what makes CRM projects fail and been either a bystander or active stakeholder in failure on several occasions with a number of different software projects.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>What I realise now is that the challenges with CRM that I experienced across the businesses I worked in are actually really common. Here are a few examples:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>The answer to all prayers</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>One of the common mistakes for small businesses is thinking that a CRM will automatically improve sales. CRM <em>can </em>do this, but it doesn’t do it ‘out of the box’. It needs a concerted effort and should represent a step-change in the way the business thinks about sales forecasting.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For CRM to be able to increase sales, the business needs to be willing to use it as part of a process of budgeting and building forecasts  (setting sales objectives). Forecast/pipeline data from CRM will help track against those objectives, but only if they are configured. If CRM isn't being used as a tool for tracking performance, staff will very quickly realise that there is no KPI measurement and the impact of CRM will be minimal. CRM needs to be part of a bigger process of change and maturity of finance strategy.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>User adoption&nbsp;</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In larger businesses with many users, it’s essential to design a CRM around the sales process. Trying to corral users into using CRM properly with guidance notes and emails doesn’t work. There must be validation in place to ensure users <em>can’t</em> use the system incorrectly.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Lead/Opportunity stages need to be clear and aligned to what actually happens in the business, with different processes where the product/service differs. Making CRM difficult to use just gives users the excuse not to use it and confuses those with good intentions. Ideally, CRM should give something back to the users; allowing them to do their job quicker or track what matters to them (hint: this is usually commissions!).&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Keep the faith&nbsp;</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The holy grail for any Salesforce/CRM customer is being able to have faith in the numbers. This means regularly reviewing the data in a collaborative way.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Getting into a weekly (or at least fortnightly) cadence of reviewing the forecast brings a new level of maturity to managing sales. Users will forget to log Opportunities, forget to reassess close dates/amounts and even forget to close them - so regular reviews are critical.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With accurate data in the system the business can have confidence in the reports it exports; without this, reporting has no value and the CRM cannot be relied upon as a method of KPI assessment.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>My experience of being part of the problem gives me a useful perspective when it comes to implementing CRM. I wasn’t always a fan of CRM (and many salespeople aren’t!); but that provides a useful perspective when it comes to understanding user sentiment and making CRM a real catalyst for positive change.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Making the change&nbsp;</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>There are so many resources available for developing a career on Salesforce and a number of different routes. Some of the roles in the Salesforce ecosystem are more ‘technical’ than others, but most of the ‘development’ is declarative (no/low code).&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>As such, making the switch from sales to Salesforce is not as difficult as it may sound. For the most part, the real challenge is identifying the issues and leveraging the right Salesforce solution. If you’re involved in consultative/solution sales, you’ll likely already have a head start in terms of skillset.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The best starting point is Salesforce Trailhead (<a href=\"https://trailhead.salesforce.com\">https://trailhead.salesforce.com</a>). They have interactive learning resources for everyone from end-users to developers and I would highly recommend it!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Good luck!</p>\n<!-- /wp:paragraph -->",
    "excerpt": "Having just achieved my 10th Salesforce Certification, Application Architect, I wanted to share a little about why I chose Salesforce consulting as a career change and what I learned in the process. If you’re working in sales and thinking about a career change to Salesforce, I hope it helps and if you want any advice, feel free to DM me on LinkedIn!",
    "link": "https://appdraft.com/2022/04/19/from-poacher-to-gamekeeper-building-a-career-in-salesforce/",
    "type": "post",
    "slug": "from-poacher-to-gamekeeper-building-a-career-in-salesforce",
    "date": "April 19, 2022",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Go with the Flow  - A Guide to Salesforce Flows",
    "content": "<!-- wp:paragraph -->\n<p>Salesforce has continued its investment in the development of Flows in recent years. Flows replaced Workflow Rules and are an intuitive, canvas-based method of designing automations. But what are the common use cases for Flows? </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Record Triggered Flows</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The most common use-cases for Flows are to automate the updating or creation of records from a trigger. The following are examples of use cases for ‘Record-Triggered Flows’</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li><strong>Lead Qualification</strong> - When a lead is created or updated in Salesforce, a record-triggered flow can automatically evaluate certain criteria such as lead score, industry, or region. If the lead meets specific criteria, the flow can update the lead status to \"Qualified\" and assign it to the appropriate sales representative based on territory or other factors</li><li><strong>Case Escalation</strong> - In a customer support scenario, when a case is created or updated, a record-triggered flow can analyse the case details such as priority, severity, or SLA status. If the case requires escalation, the flow can automatically assign it to a higher-level support agent, notify the manager, or even create a task for follow-up</li><li><strong>Inventory Management Processes</strong> - For businesses managing inventory in Salesforce, a record-triggered flow can be triggered when a product's quantity reaches a certain threshold. The flow can check the inventory levels and reorder products automatically from suppliers when inventory is low</li></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2>Screen Flows</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Screen Flows in Salesforce provide interactive experiences for users to input or view data within a guided process. he following are examples of use cases for Screen Flows:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li><strong>Customer Onboarding</strong> - Screen flows can be used to streamline customer onboarding processes. When a new customer is taken on, a Screen Flow can be initiated to collect all the necessary information relating to billing processes, preferences, credit levels, etc</li><li><strong>Customer Service</strong> - Screen flows can enhance the handing of customer service queries by providing a guided process for submitting, allocating and tracking service Cases. If you’re using Experience Cloud, you can even expose these Screen Flows directly to the customer online, guiding them through the Case creation process</li><li><strong>Order Management</strong> - Screen flows can streamline the order management process by guiding users through the steps of creating, reviewing, and processing orders. Sales representatives can use a screen flow to enter customer details, select products, specify quantities, apply discounts, and review pricing before submitting the order for processing</li></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2>Scheduled Flows</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Scheduled Flows help businesses run regular (usually daily) processes over a set of records. Here are some use cases:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li><strong>Data Cleanup</strong> - Scheduled flows can be used to perform routine data cleanup and maintenance tasks to ensure data integrity and system performance</li><li><strong>Notification and Follow-up Reminders</strong> - Scheduled flows can be employed to send out automated email notifications and follow-up reminders to users or customers at predefined intervals</li><li><strong>Report Generation and Distribution</strong> - Scheduled flows can generate and distribute reports or dashboards automatically on a recurring basis, ensuring stakeholders have access to up-to-date information</li></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>You can schedule a flow to run at the end of each month to generate sales reports, financial summaries, or performance metrics and distribute them to relevant users or teams via email or Chatter posts.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Additionally, scheduled flows can be used to archive or export data for compliance or auditing purposes, running at regular intervals to generate snapshots of data for historical record-keeping.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Flows are just one tool in the box and, as with most things Salesforce, there are many ways to achieve the same objective.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Apex </h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Apex is Salesforce’s coding language and is similar to Java. Apex is generally considered more complex to master than Flows and is the typically the preserve of developers. Developing in Apex typically takes longer than creating Flows, not least because developers will need to write accompanying test code in order to deploy it to Salesforce. So why not just use Flows?</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Apex offers a few advantages in certain circumstances: </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li><strong>Handling Large Record Numbers</strong> - Flows are constrained in several ways and, when dealing with a high number of records or individual processes, a Flow can hit ‘governor limits’ imposed by Salesforce; effectively causing a break</li><li><strong>Error Handling</strong> - Apex provides more advanced error handling capabilities compared to Flows, allowing for more sophisticated exception handling and logging</li><li><strong>Integration Requirements</strong> - If you need to integrate with external systems, perform complex data manipulations, or interact with Salesforce data at a lower level (e.g., using REST or SOAP APIs), Apex provides more flexibility and control; although Salesforce is closing this gap with Flow Actions for integration</li></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2>Summary</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Flows should be a general go-to for automation logic. They are great for rapid development and are accessible to administrators and non-developers. They offer a visual way to automate business processes without writing code. That said, fully understanding flows can take some time and they have become increasingly complex as Salesforce has developed additional features.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In summary, Apex is typically chosen for its flexibility, performance, and ability to handle complex scenarios, while Flows offer rapid development, declarative customisation, and ease of use for less complex requirements. The choice between the two often depends on the specific needs of the project and the skillset of the development team. Many projects use a combination of both Apex and Flows to leverage the strengths of each approach.</p>\n<!-- /wp:paragraph -->",
    "excerpt": "",
    "link": "https://appdraft.com/2024/02/12/go-with-the-flow-a-guide-to-salesforce-flows/",
    "type": "post",
    "slug": "go-with-the-flow-a-guide-to-salesforce-flows",
    "date": "February 12, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Understanding Salesforce Forecasts",
    "content": "<!-- wp:paragraph -->\n<p>Customers typically purchase Salesforce with the objective of either improving the sales process and the way the business tracks data or getting better at tracking the value of pipeline. These two objectives are intertwined and reliable forecasts are not possible without high user adoption, but the focus of this article is forecasts and the way these are managed in Salesforce.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The Forecast features in Salesforce are comprehensive and capable, but they are regularly under-employed in Salesforce instances. Businesses will often have some visibility of Pipeline and Opportunities in a dashboard. However, using the designated Forecast tools provide much more than pipeline dashboards, not least the fact that they are designed to be a ‘collaborative’ tool that the salesperson and sales manager can use to interrogate the veracity of the data that supports the forecast. Forecasts are also focused on a particular period, typically a month or a quarter; shifting the focus to deals that are happening <em>now</em>.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This article explores some of the key features and characteristics of Salesforce Forecasts and the value they can add to organisations.&nbsp;&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Forecast Types</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Forecasts can be based on revenue or quantity measures and can support team selling/splits. There are additional options to group by sales territories and products. This means the business can have visibility of banked sales and pipeline across product lines, territories (either geographical, vertical-based or other types of territories) and, as we will explore below, across revenue-scheduled models like subscription revenue. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Forecast Categories</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>A business might have a number of different Opportunity Stages and perhaps more than one Opportunity ‘Type’. It can be challenging for board level colleagues to understand the significance of different Opportunity stages and to know which ones are truly significant. Step forward Forecast Categories!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Forecast Categories give the business a view of possible outcomes. For example the business might simply want a view of the opportunities that are ‘Closed Won’, the opportunities that are already signed and delivered. Most businesses, however, will want to forecast ‘open’ Opportunities and will use Salesforce Forecasts to model a ‘Commit’ bet (the Opportunities that the salesperson has determined <em>will</em> complete), a ‘Best Case’ bet (those that <em>should</em> complete) and ‘Pipeline’ (those that <em>might</em> complete).&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Forecast Hierarchies</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Forecast Hierarchies allow for teams to be organised in a hierarchical structure and to provide viewing rights over Opportunities based on a user’s position within the hierarchy. This allows managers to see their team’s forecasts, but teams cannot see forecasts belonging to their teammates. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Revenue Schedules</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>This is a must for any businesses selling products or services on a subscription basis of where the revenue from a sale is distributed, i.e. where the revenue from sales is not credited to the business in a lump sum at the Close Date. Revenue Schedules help to ‘smooth-out’ revenue according to the reality of when it is expected; leading to a more accurate forecast.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Quotas</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Quotas help the business understand how its revenue goals will be attained as part of a team effort. For example, if the business expects an annual revenue of £120 million and a sales team of 10 FTE, it can assign a quota of £100k per month to each member of the team. In reality, of course, a business would allow for annual peaks and troughs in sales, but the Quota functionality is key to apportioning responsibility for an organisational target. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Manager Adjustments </h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Manager adjustments allow salesforce users to adjust their own forecasts and managers to adjust the forecast of the colleagues below them in the forecast hierarchy. The purpose of adjustments is to provide an overview/context around a figure in the forecast. For example, if a deal is significantly larger than the average deal size, a forecast manager might decide to offset the risk of that deal not materialising by adjusting the month and category that this deal falls within. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Historical Trending </h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Historical Trending allows users to visualise performance against past reference periods. For example, if your forecast is monthly, you can see how your current results at this point in the month compare to previous months. This will help the business understand whether the team is tracking to hit their sales goals based on performance in previous periods. The data presented will depend on the period of time for which data has been retained.</p>\n<!-- /wp:paragraph -->",
    "excerpt": "The article discusses the importance of forecasting in Salesforce. It explores several key features and tools available in Salesforce for forecasting and how they can benefit organisations.\n\n",
    "link": "https://appdraft.com/2024/04/28/understanding-salesforce-forecasts/",
    "type": "post",
    "slug": "understanding-salesforce-forecasts",
    "date": "April 28, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Seamless Prospecting with Salesforce &amp; LinkedIn",
    "content": "<!-- wp:paragraph -->\n<p>Tired of juggling LinkedIn and Salesforce like you're trying to master a circus act? Don’t worry, we’ve got you covered! In this video, we’ll show you how to stop losing track of your leads and finally sync LinkedIn Sales Navigator with Salesforce.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We’ll walk you through the best tools and tricks - from the pricey-but-sleek LinkedIn Sales Navigator to the more wallet-friendly Apollo - so you can keep all your prospecting efforts in one place. Say goodbye to manual data entry and hello to automated LinkedIn magic! </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Let’s get those leads out of LinkedIn and into your Salesforce like a pro—your sales pipeline will thank you! </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:embed {\"url\":\"https://youtu.be/tCWBaLQkZxc?si=Qv_nBUATTb0D1MLn\",\"type\":\"video\",\"providerNameSlug\":\"youtube\",\"responsive\":true,\"className\":\"wp-embed-aspect-16-9 wp-has-aspect-ratio\"} -->\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\nhttps://youtu.be/tCWBaLQkZxc?si=Qv_nBUATTb0D1MLn\n</div></figure>\n<!-- /wp:embed -->",
    "excerpt": "",
    "link": "https://appdraft.com/2024/09/19/seamless-prospecting-with-salesforce-linkedin/",
    "type": "post",
    "slug": "seamless-prospecting-with-salesforce-linkedin",
    "date": "September 19, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "What is a Salesforce Health Check and What Can It Do For Users?",
    "content": "<!-- wp:paragraph -->\n<p>A Salesforce Health Check is often recommended for businesses that have been using Salesforce for a while but find it no longer as effective or aligned with their evolving needs. The system may no longer match the current business processes, or perhaps the organisation has outgrown the functionality that was set up initially.&nbsp;</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Whether a business has pinpointed specific issues or is simply aware that things are not running as smoothly as they should, the true value of a Salesforce Health Check lies in revealing what you may not know. As the saying goes, \"It's impossible to know what you don't know,\" and this is where a Salesforce consultant can offer significant insight.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Adapting Salesforce to a Growing Business</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>As businesses grow, their requirements change, and Salesforce must evolve accordingly. During an initial deployment, the focus is often on keeping costs low and avoiding unnecessary functionality. However, what may have been deemed unnecessary at first can become essential as the business scales. A Salesforce Health Check ensures that your system keeps pace with your business growth.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For example, many organisations start with simple lead and opportunity processes, but as their customer base grows and the sales team expands, a more structured and efficient process may become necessary. A Health Check identifies areas where advanced tools, such as automated workflows and lead scoring, can streamline sales activities and boost efficiency.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Restoring Confidence in Salesforce</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>When Salesforce stops meeting the business’s needs, users may lose trust in the system. As a result, they often stop updating data, which diminishes Salesforce’s value as a business resource. A Health Check can help restore user confidence by realigning the system with current requirements and introducing time-saving automation features that make it easier for teams to stay engaged with the platform.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For instance, automating the logging of emails, creating renewal opportunities, or generating proposals not only saves time but also ensures more consistent use of the system, which leads to higher-quality data.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Forecasting: A Common Issue</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>One of the most frequent challenges uncovered during a Salesforce Health Check is the inefficiency of revenue forecasting. Many businesses start with basic opportunity tracking, but as they mature, they set revenue targets and need to monitor performance against those goals. Instead of using Salesforce’s native forecasting tools, some companies export data into spreadsheets for manual manipulation, which is time-consuming and produces instantly outdated information.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A Health Check can help businesses transition to Salesforce’s forecasting capabilities, offering significant benefits. These include more accurate reporting, improved data housekeeping, and enhanced visibility of sales performance. The more reliable the data, the more value users will attribute to Salesforce, boosting its overall effectiveness.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Ensuring Full Use of Salesforce Features</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Maximising the use of Salesforce’s built-in features is key to its success. A Health Check evaluates whether your organisation is taking full advantage of tools such as Einstein Activity Capture, to automatically log emails and events, reducing the manual input required from your team and providing a more complete view of customer interactions.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Additionally, businesses may not be using features like web-to-lead forms, which streamline the process of importing leads from a website into Salesforce. A Health Check ensures that your Salesforce instance is optimised for efficiency and that all useful features are being fully utilised.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Aligning Salesforce with Business Processes</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Another common issue is the misalignment of Salesforce objects with business processes. Some organisations use Salesforce objects, such as leads or opportunities, for purposes they weren’t designed for—such as tracking project statuses. This makes it difficult to measure key performance indicators (KPIs) specific to sales activities.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A Salesforce Health Check helps realign the use of objects like leads and opportunities with the roles of the sales team, ensuring the system supports clear, measurable KPIs and avoids operational clutter.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Enhancing Reporting and Dashboards</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Enhancing Reporting and Dashboards</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Effective reporting is one of the key advantages of <a href=\"https://www.salesforceben.com/\">Salesforce</a>, but without proper setup, it can also be a source of frustration. During a Health Check, the focus is often on enhancing dashboards and reports to ensure they deliver meaningful insights without overwhelming users. A few well-designed reports can improve user adoption, making Salesforce more valuable as a tool for business intelligence and decision-making.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A crucial part of any Salesforce Health Check is ensuring that users are fully engaged with the platform and understand how to use it effectively. Sometimes, specific individuals or teams may not be utilising Salesforce to its full potential, either due to a lack of training or unclear expectations. A Health Check can include recommendations for additional training or tailored support to help users get the most out of the system.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Integrating Third-Party Tools</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Integrating Third-Party Tools</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Salesforce’s capabilities can be greatly enhanced by integrating third-party tools, and a Health Check can identify where this would be beneficial. Common integrations include document generation tools, telephony solutions, and data backup services, all of which create a more robust and efficient Salesforce environment.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Managing Large Volumes of Leads</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Managing Large Volumes of Leads</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>For organisations experiencing a high volume of leads, managing them effectively can become challenging. A Salesforce Health Check might recommend tools like Sales Engagement, which helps businesses manage leads based on a structured cadence and track interactions more efficiently. Additionally, integrating marketing solutions like Marketing Cloud can automate email journeys and track engagement with marketing content, improving lead management.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Conclusion</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>A Salesforce Health Check is an invaluable process for ensuring that your Salesforce instance continues to support your business as it evolves. Whether it’s aligning the system with your current processes, optimising efficiency through automation, or improving forecasting and reporting, a Health Check ensures you’re making the most of Salesforce’s capabilities. By maintaining a well-configured, secure, and efficient Salesforce environment, you can improve user adoption, drive business growth, and maximise your return on investment.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Forecasts can be based on revenue or quantity measures and can support team selling/splits. There are additional options to group by sales territories and products. This means the business can have visibility of banked sales and pipeline across product lines, territories (either geographical, vertical-based or other types of territories) and, as we will explore below, across revenue-scheduled models like subscription revenue.&nbsp;</p>\n<!-- /wp:paragraph -->",
    "excerpt": "A Salesforce Health Check is essential for businesses that have been using Salesforce but feel it's no longer aligned with their evolving needs. Whether it’s restoring confidence in the platform, optimising efficiency with automation, or enhancing forecasting and reporting, a Health Check ensures your Salesforce instance adapts as your business grows. Discover how a thorough review of your system can reveal hidden inefficiencies and unlock the full potential of Salesforce to drive growth and improve user adoption.\n",
    "link": "https://appdraft.com/2024/10/26/what-is-a-salesforce-health-check-and-what-can-it-do-for-users/",
    "type": "post",
    "slug": "what-is-a-salesforce-health-check-and-what-can-it-do-for-users",
    "date": "October 26, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Streamlining Sales with Salesforce: The Ultimate Guide to Lead Management",
    "content": "<!-- wp:paragraph -->\n<p>Lead management is at the heart of any successful sales operation, and in Salesforce, getting it right can supercharge your team's efficiency. By refining your lead process, you'll not only streamline workflows but also set your team up for long-term success. In this article, we’ll walk you through how Salesforce’s powerful lead management features can help you capture, qualify, and convert leads more effectively.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">The Importance of the Lead Object</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The Lead object in Salesforce is vital for managing inbound enquiries and outbound prospecting, allowing your team to draw a distinction between unqualified prospects and leads that make it to conversion and become an opportunity. Leads often originate from various sources, including web-to-lead forms, social media, or data management platforms like <a href=\"https://www.apollo.io/\">Apollo</a>, <a href=\"https://www.lusha.com/\">Lusha</a>, or <a href=\"https://www.zoominfo.com/\">ZoomInfo</a>. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Without a robust system to filter and prioritise these leads, your Account database can quickly become bloated with spam or irrelevant data. This is where Salesforce’s lead management tools shine, ensuring that you only deal with quality leads that have real potential.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Automating Lead Capture</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>For businesses dealing with a high volume of leads, automation is crucial. Manual data entry (copying and pasting from platforms like LinkedIn or uploading spreadsheets) can be a real time sink. Salesforce’s native ‘web-to-lead’ forms automatically capture leads from web inquiries, and there are also integrations available for social media platforms like Facebook, Instagram, and LinkedIn. Automation reduces the likelihood of errors and speeds up the process, letting your team focus on what really matters: closing deals.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Key Lead Stages: Qualify or Disqualify</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce enables businesses to manage leads through several distinct stages:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li>New: Untouched leads waiting to be progressed.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Working: Leads that are being actively contacted.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Disqualified: Leads that are not suitable to progress.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Converted: Leads that are ready to move into opportunities.</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>For disqualified leads, it’s a good idea to track the reason for disqualification. If you're sourcing leads (and particularly if you're paying for data) analysing Lead quality can help guide future decisions. Additionally, for leads that are not ready to convert but might be in the future, a “Nurture stage” can be added. This allows you to stay in touch through regular emails or marketing tools until the timing is right.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Managing High Volumes of Leads</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Handling large numbers of leads can be overwhelming, particularly if team members are juggling hundreds at a time. In high-volume environments, cadence tools like Salesforce Sales Engagement can make a world of difference. Sales Engagement helps standardise the number of actions a lead should go through, ensuring that none fall through the cracks. Whether it’s a phone call or an email, every step is accounted for, preventing leads from being over or under-worked.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Setting up a robust set of email templates for various stages of the sales process can further boost efficiency. Combined with contact centre technologies like click-to-dial and call recording, these templates help streamline outreach and follow-up actions.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Leveraging AI for Better Results</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce offers cutting-edge AI tools like Einstein Conversation Insights, which provides insights on sales calls. By analysing talk time ratios, generating transcripts, and offering keyword analysis, Einstein can be an invaluable coaching tool for sales teams. Additionally, Einstein Lead Scoring helps Sales Development Representatives (SDRs) prioritise leads based on their likelihood to convert, drawing on patterns and data within your org.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Tracking Lead Performance with Dashboards</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>No lead management strategy is complete without dashboards and reports to monitor performance. Weekly summaries showing inbound vs. converted leads broken down by SDR can highlight areas for improvement and allow for better distribution of leads across the team. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For more advanced lead distribution, Salesforce offers Lead Assignment Rules and Territory Management in Enterprise edition. This enables you to assign leads based on criteria such as geographic territory, product interest or other characteristics.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Boosting Productivity with Einstein Activity Capture</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>To keep everything in sync, Einstein Activity Capture automatically integrates emails and calendar events from Google Workspace or Microsoft 365 into Salesforce. This reduces administrative overhead and ensures that communication with leads is always tracked within the CRM, helping teams stay organised and improving transparency.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Mastering lead management in Salesforce is about more than just capturing enquiries. It's about building a streamlined, automated process that supports your team’s efforts to qualify, nurture, and convert leads effectively. By leveraging Salesforce’s powerful tools, from automation and AI to advanced reporting, you can ensure that no lead is wasted and that your team is always working efficiently. With the right setup, your business can turn lead management into a well-oiled machine, driving growth and improving conversion rates.&nbsp;</p>\n<!-- /wp:paragraph -->",
    "excerpt": "Lead management is the backbone of any sales-driven business, and with Salesforce, you can transform the way your team handles inquiries. From automating lead capture to leveraging AI tools that predict conversion potential, Salesforce enables you to optimise every step of the process. Whether you’re managing a high volume of leads or honing in on top prospects, Salesforce's robust features ensure your team works smarter, not harder. ",
    "link": "https://appdraft.com/2024/10/27/streamlining-sales-with-salesforce-the-ultimate-guide-to-lead-management/",
    "type": "post",
    "slug": "streamlining-sales-with-salesforce-the-ultimate-guide-to-lead-management",
    "date": "October 27, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Transform Customer Interactions with AgentForce",
    "content": "<!-- wp:paragraph -->\n<p>Discover how <strong>AgentForce by Salesforce</strong> is reshaping the way businesses engage with customers in our latest demo video. Using the fictional Coral Cloud Resorts as an example, we dive into the transformative power of generative AI and its seamless integration with Salesforce. Here's a quick summary of what you'll learn:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>From Chat to Generative AI</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li>Trace the evolution of chat functionality from simple widgets to sophisticated AI-driven bots.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>See how AgentForce leverages natural language understanding to deliver accurate, conversational responses using Salesforce data.</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p><strong>Personalised Customer Experiences</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li>Watch a demo of a guest booking a relaxing experience through the chat widget.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>See how AgentForce verifies details, identifies customer preferences, and completes bookings in real time.</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p><strong>Seamless Salesforce Integration</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li>Go behind the scenes to see how AgentForce updates records, checks availability, and handles booking details directly in Salesforce.</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:embed {\"url\":\"https://youtu.be/Bz-QsWnH3B4\",\"type\":\"video\",\"providerNameSlug\":\"youtube\",\"responsive\":true,\"className\":\"wp-embed-aspect-16-9 wp-has-aspect-ratio\"} -->\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\nhttps://youtu.be/Bz-QsWnH3B4\n</div></figure>\n<!-- /wp:embed -->",
    "excerpt": "",
    "link": "https://appdraft.com/2024/11/20/transform-customer-interactions-with-agentforce/",
    "type": "post",
    "slug": "transform-customer-interactions-with-agentforce",
    "date": "November 20, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "SFX: Seamless Integration for Salesforce + Xero",
    "content": "<!-- wp:paragraph -->\n<p><a href=\"https://www.youtube.com/@appdraftco\"></a></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Discover how SFX transforms the way you manage financial data by connecting Salesforce with Xero! In this demo, we explore: Why you should integrate Salesforce with Xero</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li>Gain visibility into client billing trends</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Effortlessly compare accounts and resolve invoice queries</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Automate invoice creation and eliminate manual, error-prone processes</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>SFX in Action</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li>Demo of SFX billing in Salesforce</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li>Two-way sync between Xero and Salesforce</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:paragraph -->\n<p>A basic setup takes as little as 15 hours, making SFX a smart investment for any business! </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Unlock improved productivity, accuracy, and collaboration by integrating Salesforce and Xero today. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Contact us now to explore how SFX can revolutionise your workflow!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:embed {\"url\":\"https://youtu.be/RZXdpPqp6uE?si=CmMPK7CCeVo6EKTi\",\"type\":\"video\",\"providerNameSlug\":\"youtube\",\"responsive\":true,\"className\":\"wp-embed-aspect-16-9 wp-has-aspect-ratio\"} -->\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\nhttps://youtu.be/RZXdpPqp6uE?si=CmMPK7CCeVo6EKTi\n</div></figure>\n<!-- /wp:embed -->",
    "excerpt": "",
    "link": "https://appdraft.com/2024/11/25/sfx-seamless-integration-for-salesforce-xero/",
    "type": "post",
    "slug": "sfx-seamless-integration-for-salesforce-xero",
    "date": "November 25, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Einstein Trust Layer: How Salesforce Protects Data the Age of Generative AI",
    "content": "<!-- wp:heading -->\n<h2 class=\"wp-block-heading\"></h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Are you using Chat GPT in a business context? Ever thought about what happens to the information you feed it? If you’re feeding it customer data or sensitive business information, the answer might surprise you! To save you the trouble, we asked Chat GPT. Here is the response: </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><em>Sharing data with ChatGPT risks exposure of sensitive information, as conversations may be retained for training. While anonymised, data could be accessed if required by law. Avoid sharing private, confidential, or personal details to mitigate potential security or privacy issues.</em></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Not very reassuring is it? </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Generative AI is embedded in lots of business applications. Without adequate safeguards, the use of these new technologies opens up risk for organisations.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Salesforce meets this challenge head on by leveraging the Einstein Trust Layer. This article explains what the Einstein Trust Layer is and the key features that make it indispensable.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">\n\t\tWhat Is the Einstein Trust Layer?\n\t</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The Einstein Trust Layer is Salesforce’s framework for securely integrating generative AI, like large language models (LLMs), into its ecosystem. It ensures that customer data remains private, responses align with ethical standards, and AI outputs are professional and accurate.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>At its core, the Trust Layer creates a secure interaction environment for AI tools by implementing safeguards throughout the data journey, from generating prompts to delivering responses.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">\n\t\tKey Features of the Einstein Trust Layer\n\t</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p><strong>Zero Data Retention</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Unlike consumer-grade AI tools, Salesforce enforces a strict zero data retention policy. This means that once an LLM processes a prompt, neither the prompt nor the generated response is stored. This prevents external AI providers, such as OpenAI, from retaining sensitive customer data.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Toxic Language Detection</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The Trust Layer scans AI-generated responses for toxic content, including hate speech, violent or sexual language, and profanity. This ensures that the responses are appropriate and professional.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Data Masking and Demasking</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Before being sent to the LLM, personal data is masked/tokenised. On the return journey, that masked data is safely restored to personalise replies.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Prompt Defense / Guardrails</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Prompt Builder adds guardrails to guide the LLM's behaviour, preventing unintended or harmful outputs. It can include instructions to avoid generating responses outside its knowledge or providing responses relating to certain topics. This can be imperative in regulated industries where only qualified members of an organisation can give advice, e.g. financial or legal advice.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong>Comprehensive Audit Trail</strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Every interaction, from prompt creation to response delivery, is logged with an audit trail. This enhances accountability, allowing businesses to monitor how their data is processed and used.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">\n\t\tIn Summary\n\t</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Generative AI as a basis for agentic support and sales is going to be transformational. Businesses that adopt it will be able to benefit from tangible efficiencies with lower staff costs and faster response times for customers. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>But it's not all sunlit uplands. The risks involved in using these tools is real and ignoring these risks will almost certainly open up liability for organisations. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With  Einstein Trust Layer, Salesforce customers can harness the power of generative AI and agentic automation whilst maintaining data privacy, security, and ethical responsibility.</p>\n<!-- /wp:paragraph -->",
    "excerpt": "",
    "link": "https://appdraft.com/2024/12/01/salesforce-einstein-trust-layer/",
    "type": "post",
    "slug": "salesforce-einstein-trust-layer",
    "date": "December 1, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "The Importance of Diversity in Consultancy: Unleashing New Perspectives for IT Projects",
    "content": "<!-- wp:paragraph -->\n<p>In the world of consultancy, especially in IT projects, success is often determined by the ability to solve complex problems, innovate, and anticipate the needs of clients. While technical expertise is undoubtedly critical, one factor that can significantly influence the outcome of a project is the diversity of the consulting team. A diverse workforce brings a wide array of perspectives, experiences, and ideas that can transform the way problems are approached and solutions are implemented.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">The Value of Diverse Perspectives</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Diversity in consultancy refers not only to race, gender, and ethnicity but also to diversity in thought, background, and experience. By bringing together individuals from different walks of life, consultancy teams can leverage these varied perspectives to enhance the creativity and innovation that drives IT projects forward.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong><strong>Creative Problem Solving</strong></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A homogenous team might approach problems with a similar mindset, potentially limiting the range of solutions considered. In contrast, a diverse team is more likely to offer a broader spectrum of ideas, resulting in more creative and out-of-the-box solutions. For example, an IT project focused on developing a customer-facing application may benefit from the input of team members who bring different cultural insights, understanding how the application might be used across diverse demographic groups. This diversity can lead to solutions that are more inclusive and user-friendly for a global audience.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong><strong>Enhanced Innovation</strong></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>IT is an ever-evolving field, and the best solutions are often those that break away from conventional thinking. A team that draws from a wide variety of backgrounds can challenge the status quo and offer fresh approaches. Whether it's a new programming technique, a novel way of structuring data, or an unexpected use case for technology, diversity fuels the kind of innovation that can set a consultancy apart in a crowded market.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong><strong>Better Understanding of Client Needs</strong></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In IT consultancy, understanding the client’s needs is crucial to delivering effective solutions. A diverse team is more likely to be able to relate to a broader range of clients and stakeholders, thanks to the variety of experiences they bring. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Building a Diverse IT Consultancy Team</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>To unlock the full potential of diversity in consultancy, organisations must be intentional in their efforts to build and nurture diverse teams. This starts with a commitment to inclusive hiring practices, ensuring that candidates from diverse backgrounds are actively recruited and given equal opportunities. It also requires an ongoing commitment to creating an inclusive workplace culture where all voices are valued and respected.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong><strong>Recruiting for Diversity</strong></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Building a diverse team requires looking beyond the usual candidates. Organisations should seek to recruit individuals from a variety of backgrounds, including those from underrepresented groups. This means not only focusing on race and gender but also considering factors like education, socioeconomic background, and geographic location. By actively pursuing diversity, consultancies can ensure they have the right mix of perspectives to tackle complex challenges.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong><strong>Fostering an Inclusive Culture</strong></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A diverse team is only as strong as its ability to collaborate effectively. To ensure that diversity has a positive impact, organisations must create an inclusive environment where all team members feel valued. This includes promoting open communication, encouraging idea-sharing, and addressing any biases that may arise. When everyone feels heard and respected, the full potential of diversity can be realised.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p><strong><strong><strong>Providing Continuous Training</strong></strong></strong></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Diversity and inclusion are ongoing efforts that require continuous learning and development. Firms should provide training to help employees understand the importance of diversity, manage biases, and foster an inclusive environment. This training helps build a more cohesive team and ensures that diversity becomes an integral part of the company’s DNA.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">The Positive Impact on Client Relationships</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>When a firm demonstrates a commitment to diversity, it can also have a profound impact on client relationships. Clients are increasingly looking for partners who not only offer technical expertise but also align with their values, including diversity and inclusion. A consultancy team that reflects these values is more likely to establish stronger, more trusting relationships with clients.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A diverse team is also better equipped to understand the challenges faced by clients in different sectors. Whether it’s navigating regulatory requirements in different countries, developing solutions for diverse user bases, or addressing unique business challenges, a team with varied experiences can offer more tailored, effective advice. This enhances the overall value the consultancy can provide, resulting in stronger client outcomes and long-term partnerships.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Conclusion</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Diversity can be a strategic advantage. By bringing together individuals with diverse backgrounds and perspectives, consultancy teams can solve problems more creatively, innovate more effectively, and deliver solutions that are better aligned with clients’ needs. In today’s global and interconnected world, diverse teams are more likely to succeed in creating impactful, inclusive solutions for the complex challenges of the modern era.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The benefits of diversity in consultancy extend beyond just the team dynamics; they ripple out to clients, stakeholders, and the wider community. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->",
    "excerpt": "Diversity in consultancy is more than just a buzzword, it's a strategic advantage, particularly in the fast-paced world of IT projects. A diverse team brings a wide array of perspectives, fostering creativity, innovation, and better problem-solving. By drawing from varied backgrounds, experiences, and cultures, consultants can approach challenges with fresh ideas and develop solutions that are more inclusive and tailored to the needs of a global client base. In a competitive market, embracing diversity not only strengthens internal collaboration but also enhances client relationships, ensuring that solutions are relevant, effective, and impactful.",
    "link": "https://appdraft.com/2024/08/23/the-importance-of-diversity-in-consultancy-unleashing-new-perspectives-for-it-projects/",
    "type": "post",
    "slug": "the-importance-of-diversity-in-consultancy-unleashing-new-perspectives-for-it-projects",
    "date": "August 23, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "Sustainability in Consultancy: Guiding Change from Within",
    "content": "<!-- wp:paragraph -->\n<p>As sustainability becomes a core element of business strategy, consulting firms are uniquely positioned to lead the way. They have the dual responsibility of improving their internal practices while guiding clients toward more sustainable operations. While SaaS and digital-focused consultancies may not have extensive physical infrastructures to overhaul, there are still meaningful opportunities to integrate sustainability into their operations, culture, and advisory services.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Sustainable Remote Work and Travel Policies</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>For many consultancies, commuting and business travel account for the largest share of their environmental impact. Firms can address this by:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li><strong>Remote Work Optimisation:</strong> Encourage remote-first policies to minimise carbon emissions from commuting and office energy use.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li><strong>Sustainable Travel Policies:</strong> Favour virtual meetings over travel, and when travel is necessary, prioritise low-impact options such as trains instead of flights.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li><strong>Carbon Offsetting:</strong> Invest in credible carbon offset programmes to neutralise emissions caused by unavoidable travel.</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Building a Culture of Sustainability</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Sustainability isn’t just about policies—it’s about shaping a mindset across the organisation:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li><strong>Employee Education:</strong> Deliver regular training sessions on sustainable practices to ensure employees understand their role in driving change.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li><strong>Behavioural Shifts:</strong> Encourage everyday sustainable habits, from reducing waste to mindful energy consumption.</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Ethical and Sustainable Partnerships</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Sustainability extends beyond internal operations to include the supply chain and vendor relationships:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li><strong>Vendor Selection:</strong> Partner with suppliers who demonstrate strong environmental and ethical standards.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li><strong>Sustainable Procurement:</strong> Prioritise eco-friendly materials, digital tools, and sustainable service providers.</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Thought Leadership for Lasting Impact</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Consultancies have a unique platform to drive sustainable thinking across industries:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:list -->\n<ul><!-- wp:list-item -->\n<li><strong>Knowledge Sharing:</strong> Publish whitepapers, case studies, and reports highlighting successful sustainability initiatives.</li>\n<!-- /wp:list-item -->\n\n<!-- wp:list-item -->\n<li><strong>Advocacy:</strong> Guide clients to identify sustainability opportunities, such as reducing unnecessary travel, improving route planning for customer visits, or adopting paperless workflows.</li>\n<!-- /wp:list-item --></ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Looking Ahead: The Future of Sustainability in Consultancy</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Clients are increasingly focused on achieving their sustainability goals and creating meaningful change. Consultancies play a crucial role in helping them view their challenges through a sustainability lens, identifying opportunities for innovation, and implementing impactful strategies.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>While the nature of consulting often presents fewer opportunities for direct environmental action, it also makes every initiative more significant. By embedding sustainable practices internally and championing change externally, consultancies can drive far-reaching positive outcomes across industries.</p>\n<!-- /wp:paragraph -->",
    "excerpt": "As sustainability becomes a key driver of business strategy, consulting firms are uniquely positioned to lead change; both by improving their internal practices and guiding clients towards greener solutions. From optimising remote work and travel policies to fostering a culture of sustainability and advocating through thought leadership, consultancies have powerful opportunities to make a difference. While SaaS and digital consultancies may have limited physical infrastructures to overhaul, their influence and strategic insight can drive meaningful, industry-wide change.",
    "link": "https://appdraft.com/2024/08/02/sustainability-in-consultancy-guiding-change-from-within/",
    "type": "post",
    "slug": "sustainability-in-consultancy-guiding-change-from-within",
    "date": "August 2, 2024",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  },
  {
    "title": "How Salesforce Sales Engagement Supercharges Your Outbound Sales",
    "content": "<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Intro</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Struggling with inconsistent lead follow-ups and inefficient sales processes? In this video, we explore Salesforce Sales Engagement, a powerful tool designed to automate and standardise your outbound sales efforts.  </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Key Takeaways</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>✅ Lead Management Challenges – Sales reps handle leads differently, leading to inefficiencies and wasted marketing budget. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>✅ Cadences for Structured Outreach – Standardised sequences of calls and emails ensure leads are followed up properly.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>✅ Work Queue for Efficiency – Moves reps away from disorganised lead lists to a prioritised, daily task queue. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>✅ Intelligent Lead Scoring – Helps reps focus on the leads most likely to convert. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>✅ Call Scripts &amp; Automated Emails – Ensures reps say the right things and send optimised messages. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>✅ Managerial Oversight – Track engagement, refine processes, and cut ineffective steps to boost conversion rates. </p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Watch to see how Sales Engagement transforms outbound sales and makes follow-ups seamless!</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:embed {\"url\":\"https://youtu.be/_wzqJuFj_wo\",\"type\":\"video\",\"providerNameSlug\":\"youtube\",\"responsive\":true,\"className\":\"wp-embed-aspect-16-9 wp-has-aspect-ratio\"} -->\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\nhttps://youtu.be/_wzqJuFj_wo\n</div></figure>\n<!-- /wp:embed -->",
    "excerpt": "Struggling with inconsistent lead follow-ups and wasted sales opportunities? Salesforce Sales Engagement transforms outbound sales by automating cadences, prioritising leads with intelligent scoring, and streamlining daily tasks with a work queue. Discover how it ensures every lead gets the right level of attention while giving managers real-time insights to optimise outreach strategies.",
    "link": "https://appdraft.com/2025/03/11/salesforce-sales-engagement-automate-outbound-sales/",
    "type": "post",
    "slug": "salesforce-sales-engagement-automate-outbound-sales",
    "date": "March 11, 2025",
    "category": "Insights",
    "author": {
      "name": "Appdraft Team",
      "role": "Salesforce Consultants"
    }
  }
]